app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.user = current_user
    @message.save
---
INSERT INTO "messages" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "hi"], ["user_id", 2], ["room_id", 1], ["created_at", "2022-11-01 18:52:07.924943"], ["updated_at", "2022-11-01 18:52:07.924943"]]